backend/jmeter/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET health,262,5,2,85,8.21,0.000%,.20326,0.05,0.04,246.6
GET clases del dataset,238,1969,373,4584,881.06,0.000%,.18449,0.12,0.03,655.0
GET version del modelo,230,6,2,37,4.77,0.000%,.17888,0.09,0.03,529.0
POST registrar muestra,201,5,2,75,8.05,0.000%,.15652,0.05,0.05,351.0
TOTAL,931,508,2,4584,965.46,0.000%,.72165,0.31,0.15,443.3